app/views/comments/_item.html.erb

    <div class="collection-item">
        <span class="right"><%= comment.created_at %></span><br>
---
INSERT INTO "comments" ("user_id", "post_id", "context", "nickname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["post_id", 1], ["context", "안녕하세여 ㅎㅎ"], ["nickname", "관리자"], ["created_at", "2019-01-05 13:34:05.222479"], ["updated_at", "2019-01-05 13:34:05.222479"]]