app/controllers/applies_controller.rb

  def index
    @applies = Apply.all
---
SELECT "applies".* FROM "applies"

  def create
    @apply = Apply.new(apply_params)

    respond_to do |format|
      if @apply.save
---
INSERT INTO "applies" ("student_id", "name", "department", "contact", "nonuser_email", "question1_radio", "question2_radio", "question3_radio", "question4_radio", "question1_str", "question2_str", "question3_str", "question4_str", "question5_str", "last_word", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_apply
      @apply = Apply.find(params[:id])
---
SELECT  "applies".* FROM "applies" WHERE "applies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]