app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])

        @comment = @post.comments.build(comment_params)

        # @c_user= @comment.user_id


        # @c_user_nickname=@c_user.find(nickname: params[:nickname])
        # @comment_user= User.find_by(id:@c_user)
        # @comment.nickname = @comment_user.nickname


        if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "context", "nickname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["post_id", 1], ["context", "안녕하세여 ㅎㅎ"], ["nickname", "관리자"], ["created_at", "2019-01-05 13:34:05.222479"], ["updated_at", "2019-01-05 13:34:05.222479"]]