app/controllers/notices_controller.rb

  def index
    if params[:search]
      @notices = Notice.search(params[:search])
---
SELECT "notices".* FROM "notices"

  def create
    Notice.create(title: params[:notice][:title], content: params[:notice][:content], deadline: params[:notice][:deadline])
---
INSERT INTO "notices" ("title", "content", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @notice = Notice.find(params[:id])
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @notice = Notice.find(params[:id])
    @notice.destroy
---
SELECT  "notices".* FROM "notices" WHERE "notices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notices" WHERE "notices"."id" = ?  [["id", 1]]