app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |format|
        if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at", "user_nickname", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "호루"], ["content", "ㄹ호ㅜㅀㅅㄱ"], ["user_id", 1], ["created_at", "2018-11-15 07:50:09.831778"], ["updated_at", "2018-11-15 07:50:09.831778"], ["user_nickname", "아기사자"], ["category", "백엔드"]]