app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE (category LIKE '%친목후기%')
---
  def index
    if params[:category]
      @reviews = Review.search(params[:category])

INSERT INTO "reviews" ("title", "content", "user_id", "created_at", "updated_at", "category") VALUES (?, ?, ?, ?, ?, ?)  [["title", "ㄴㅇㅀ"], ["content", "ㅇㄴㅀㅎㅎ"], ["user_id", 1], ["created_at", "2018-11-12 08:45:35.753299"], ["updated_at", "2018-11-12 08:45:35.753299"], ["category", "해커톤"]]
---
  def create
    @review = Review.new(review_params)

    uploader = ReviewImageUploader.new
    if params[:review][:image] != nil
      uploader.store!(params[:review][:image])
      @review.image = uploader.url
    end

    if params[:review][:image2] != nil
      uploader.store!(params[:review][:image2])
      @review.image2 = uploader.url
    end

    if params[:review][:image3] != nil
      uploader.store!(params[:review][:image3])
      @review.image3 = uploader.url
    end

    if params[:review][:image4] !=nil
      uploader.store!(params[:review][:image4])
      @review.image4 = uploader.url
    end


    respond_to do |format|
      if @review.save

UPDATE "reviews" SET "image" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["image", "#<ActionDispatch::Http::UploadedFile:0x00007fffd0548530>"], ["updated_at", "2018-11-15 07:58:38.083457"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @review.update(review_params)